app/controllers/exhibitors_controller.rb

  def index
    @category = Category.all
    @exhibitors = Exhibitor.all(:order => 'title')
---
SELECT "exhibitors".* FROM "exhibitors"

  def create
    @exhibitor = Exhibitor.new(exhibitor_params)


    respond_to do |format|
      if @exhibitor.save
---
INSERT INTO "exhibitors" ("created_at", "description", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @exhibitor.update(exhibitor_params)
---
UPDATE "exhibitors" SET "title" = ?, "description" = ?, "image_url" = ?, "updated_at" = ? WHERE "exhibitors"."id" = 980190962  [["title", "Lorem Ipsum"], ["description", "Barca is best"], ["image_url", "kaffemaskin.jpeg"], ["updated_at", Thu, 02 Jan 2014 16:33:23 UTC +00:00]]

  def destroy
    @exhibitor.destroy
---
DELETE FROM "exhibitors" WHERE "exhibitors"."id" = ?  [["id", 980190962]]

  def set_exhibitor
    @exhibitor = Exhibitor.find(params[:id])
---
SELECT "exhibitors".* FROM "exhibitors" WHERE "exhibitors"."id" = ? LIMIT 1  [["id", "980190962"]]